Repository: astechtic/ayuvo
Catalog: ios/calorietracker/Localizable.xcstrings
Source language: en
Languages: ar, az, cs, de, es, fr, hi, it, ja, ko, nl, pl, pt_br, ro, ru, uk, zh_hans

source: You reached your %@ fasting goal. End the fast when you're ready.
ar: لقد بلغت هدف الصيام لمدة %@. أنهِ الصيام عندما تكون مستعدًا.
az: %@ oruc hədəfinə çatdınız. Hazır olduqda orucu bitirin.
de: Du hast dein Fastenziel von %@ erreicht. Beende das Fasten, wenn du bereit bist.
es: Has alcanzado tu objetivo de ayuno de %@. Termina el ayuno cuando quieras.
fr: Tu as atteint ton objectif de jeûne de %@. Termine le jeûne quand tu es prêt.
hi: आपने %@ का उपवास लक्ष्य पूरा कर लिया है। तैयार होने पर उपवास समाप्त करें।
it: Hai raggiunto l’obiettivo di digiuno di %@. Termina il digiuno quando vuoi.
ja: %@の断食目標を達成しました。準備ができたら断食を終了してください。
ko: %@ 단식 목표를 달성했습니다. 준비되면 단식을 종료하세요.
nl: Je hebt je vastendoel van %@ bereikt. Beëindig het vasten wanneer je klaar bent.
pl: Cel postu %@ został osiągnięty. Zakończ post, gdy będziesz gotowy.
pt_br: Você atingiu sua meta de jejum de %@. Encerre o jejum quando estiver pronto.
ro: Ai atins obiectivul de post de %@. Încheie postul când ești pregătit.
ru: Вы достигли цели голодания %@. Завершите голодание, когда будете готовы.
uk: Ви достигли цели голодания %@. Завершите голодание, когда будете готови.
zh_hans: 你已达到%@的禁食目标。准备好后即可结束禁食。

source: You'll reach your goal in
ar: ستصل إلى هدفك خلال
az: Hədəfinizə çatacaqsınız
cs: Cíle dosáhneš za
de: Du erreichst dein Ziel in
es: Alcanzarás tu objetivo en
fr: Vous atteindrez votre objectif dans
hi: आप अपना लक्ष्य इतने समय में प्राप्त करेंगे
it: Raggiungerai il tuo obiettivo in
ja: 目標達成までの期間
ko: 목표 달성까지
nl: Je bereikt je doel in
pl: Osiągniesz cel za
pt_br: Você atingirá sua meta em
ro: Îți vei atinge obiectivul în
ru: Вы достигнете цели через
uk: Ви достигнете цели через
zh_hans: 你将在此时间后达成目标

source: You've reached your goal weight! Head to Settings to switch your goal (Maintain, Lose, or Gain) and tap Recalculate Goals to refresh your targets.
ar: لقد وصلت إلى وزنك المستهدف! انتقل إلى الإعدادات لتبديل هدفك (الحفاظ، إنقاص، أو زيادة) ثم اضغط على إعادة حساب الأهداف لتحديث مقاييسك.
az: Hədəf çəkinizə çatdınız! Hədəfinizi dəyişdirmək üçün Parametrlərə keçin (Saxla, Azalt və ya Artır) və hədəfləri yeniləmək üçün Hədəfləri Yenidən Hesabla düyməsinə toxunun.
cs: Tvoje cílová váha je tady! Přejdi do Nastavení, přepni svůj cíl (Udržovat, Zhubnout nebo Přibrat) a klepni na Přepočítat cíle pro nové hodnoty.
de: Du hast dein Zielgewicht erreicht! Gehe zu den Einstellungen, um dein Ziel zu ändern (Halten, Abnehmen oder Zunehmen), und tippe auf „Ziele neu berechnen“, um deine Zielwerte zu aktualisieren.
es: ¡Has alcanzado tu peso objetivo! Ve a Ajustes para cambiar tu objetivo (Mantener, Perder o Ganar) y toca Recalcular objetivos para actualizar tus metas.
fr: Vous avez atteint votre poids cible ! Allez dans Réglages pour changer d'objectif (Maintenir, Perdre ou Prendre) et appuyez sur Recalculer les objectifs pour actualiser vos cibles.
hi: आप अपने लक्ष्य वजन तक पहुँच गए हैं! अपने लक्ष्य को बदलने के लिए (बनाए रखें, घटाएं या बढ़ाएं) सेटिंग्स पर जाएं और अपने लक्ष्य अपडेट करने के लिए लक्ष्य पुनः गणना करें पर टैप करें।
it: Hai raggiunto il peso obiettivo! Vai in Impostazioni per cambiare obiettivo (Mantieni, Perdi o Aumenta) e tocca Ricalcola obiettivi per aggiornare i tuoi target.
ja: 目標体重に到達しました！設定で目標（維持、減量、増量）を切り替えて「目標を再計算」をタップし、ターゲットを更新してください。
ko: 목표 체중에 도달했습니다! 설정에서 목표(유지, 감량 또는 증량)를 변경한 후 목표 다시 계산을 탭하여 목표치를 갱신하세요.
nl: Je hebt je streefgewicht bereikt! Ga naar Instellingen om je doel te wijzigen (Behouden, Afvallen of Aankomen) en tik op Doelen opnieuw berekenen om je doelen bij te werken.
pl: Osiągnięto wagę docelową! Przejdź do Ustawień, aby zmienić cel (Utrzymanie, Redukcja lub Przyrost), i stuknij Przelicz cele, aby odświeżyć cele.
pt_br: Você atingiu seu peso-meta! Vá até Ajustes para mudar sua meta (Manter, Perder ou Ganhar) e toque em Recalcular metas para atualizar seus alvos.
ro: Ți-ai atins greutatea obiectiv! Mergi la Setări pentru a schimba obiectivul (Menține, Slăbește sau Câștigă) și atinge Recalculează obiectivele pentru a actualiza țintele.
ru: Вы достигли целевого веса! Перейдите в Настройки, чтобы сменить цель (Поддержание, Снижение или Набор), и нажмите «Пересчитать цели», чтобы обновить показатели.
uk: Ви достигли целевого веса! Перейдите в Налаштування, чтоби сменить цель (Поддержание, Снижение или Набор), и натисніть «Пересчитать цели», чтоби обновить показатели.
zh_hans: 你已达到目标体重！前往“设置”切换目标（维持、减重或增重），然后点按“重新计算目标”以更新你的目标。

source: Your API key, weight history, body fat history, and food log all stay on this device. Ayuvo's developer never receives any of your data — requests go directly from your device to the provider.
ar: مفتاح API الخاص بك، وسجل الوزن، وسجل نسبة الدهون في الجسم، وسجل الطعام — كلها تبقى على هذا الجهاز. لا يتلقّى مطوّر Ayuvo أيًا من بياناتك أبدًا — تذهب الطلبات مباشرةً من جهازك إلى المزوّد.
az: API açarınız, çəki tarixçəsi, bədən yağı tarixçəsi və yemək jurnalı — hamısı bu cihazda qalır. Ayuvo tərtibatçısı sizin məlumatlarınızdan heç birini almır — sorğular cihazınızdan birbaşa provayderə gedir.
cs: Tvůj API klíč, historie váhy, historie tělesného tuku i deník jídel zůstávají v tomto zařízení. Vývojář Ayuvo žádná tvoje data nedostává — požadavky jdou přímo z tvého zařízení k poskytovateli.
de: Dein API-Schlüssel, dein Gewichtsverlauf, dein Körperfettverlauf und dein Ernährungstagebuch bleiben alle auf diesem Gerät. Der Entwickler von Ayuvo erhält keine deiner Daten — Anfragen gehen direkt von deinem Gerät an den Anbieter.
es: Tu clave de API, tu historial de peso, tu historial de grasa corporal y tu registro de comidas permanecen en este dispositivo. El desarrollador de Ayuvo nunca recibe ninguno de tus datos: las solicitudes van directamente desde tu dispositivo al proveedor.
fr: Votre clé API, votre historique de poids, votre historique de masse grasse et votre journal alimentaire restent tous sur cet appareil. Le développeur de Ayuvo ne reçoit jamais aucune de vos données — les requêtes vont directement de votre appareil au fournisseur.
hi: आपकी API कुंजी, वजन का इतिहास, बॉडी फैट का इतिहास और फूड लॉग — सब कुछ इसी डिवाइस पर रहता है। Ayuvo के डेवलपर को आपका कोई भी डेटा कभी नहीं मिलता — अनुरोध सीधे आपके डिवाइस से प्रदाता को जाते हैं।
it: La tua chiave API, lo storico del peso, lo storico della massa grassa e il diario alimentare restano tutti su questo dispositivo. Lo sviluppatore di Ayuvo non riceve mai nessuno dei tuoi dati — le richieste vanno direttamente dal tuo dispositivo al fornitore.
ja: APIキー、体重履歴、体脂肪履歴、食事記録はすべてこの端末に残ります。Ayuvoの開発者があなたのデータを受け取ることは一切ありません。リクエストは端末から直接プロバイダーへ送信されます。
ko: API 키, 체중 기록, 체지방 기록, 식사 일지는 모두 이 기기에 보관됩니다. Ayuvo 개발자는 어떠한 데이터도 받지 않습니다 — 요청은 기기에서 제공업체로 직접 전송됩니다.
nl: Je API-sleutel, gewichtsgeschiedenis, vetpercentage-geschiedenis en voedingslogboek blijven allemaal op dit apparaat. De ontwikkelaar van Ayuvo ontvangt nooit een van je gegevens — verzoeken gaan rechtstreeks van je apparaat naar de provider.
pl: Twój klucz API, historia wagi, historia tkanki tłuszczowej i dziennik jedzenia zostają na tym urządzeniu. Deweloper Ayuvo nigdy nie otrzymuje Twoich danych — żądania idą bezpośrednio z urządzenia do dostawcy.
pt_br: Sua chave de API, histórico de peso, histórico de gordura corporal e diário alimentar ficam todos neste dispositivo. O desenvolvedor do Ayuvo nunca recebe nenhum dos seus dados — as solicitações vão direto do seu dispositivo para o provedor.
ro: Cheia ta API, istoricul greutății, istoricul grăsimii corporale și jurnalul alimentar rămân toate pe acest dispozitiv. Dezvoltatorul Ayuvo nu primește niciodată vreuna dintre datele tale — solicitările merg direct de pe dispozitivul tău la furnizor.
ru: Ваш API-ключ, история веса, история процента жира и журнал питания остаются на этом устройстве. Разработчик Ayuvo никогда не получает ваших данных — запросы идут напрямую с вашего устройства к провайдеру.
uk: Ваш API-ключ, история веса, история процента жира и журнал питания остаются на етом устройстве. Разработчик Ayuvo никогда не получает ваших данних — запроси идут напрямую с вашего устройства к провайдеру.
zh_hans: 你的 API 密钥、体重记录、体脂记录和饮食日志都保留在本设备上。Ayuvo 开发者永远不会收到你的任何数据 — 请求直接从你的设备发送到提供商。

source: Your coach can see your weight history, calorie log, and goals. Ask about expected weight, what to eat, or how to hit your target.
ar: يمكن لمدربك الاطلاع على سجل وزنك وسعراتك الحرارية وأهدافك. اسأل عن الوزن المتوقع أو ماذا تأكل أو كيف تحقق هدفك.
az: Məşqçin çəki tarixçəni, kalori qeydlərini və məqsədlərini görə bilər. Gözlənilən çəki, nə yeməli və hədəfə necə çatacağın barədə soruş.
cs: Kouč vidí tvou historii váhy, deník kalorií a cíle. Zeptej se na očekávanou váhu, co jíst nebo jak dosáhnout cíle.
de: Dein Coach sieht dein Gewichtsverlauf, deine Kalorien und Ziele. Frag nach erwartetem Gewicht, was du essen solltest oder wie du dein Ziel erreichst.
es: Tu coach puede ver tu historial de peso, registro de calorías y objetivos. Pregúntale sobre el peso esperado, qué comer o cómo alcanzar tu meta.
fr: Votre coach voit votre historique de poids, votre journal calorique et vos objectifs. Demandez-lui le poids attendu, quoi manger ou comment atteindre votre but.
hi: आपका कोच आपका वज़न इतिहास, कैलोरी लॉग और लक्ष्य देख सकता है। अपेक्षित वज़न, क्या खाएं, या लक्ष्य कैसे प्राप्त करें, के बारे में पूछें।
it: Il tuo coach vede cronologia del peso, registro delle calorie e obiettivi. Chiedi il peso previsto, cosa mangiare o come raggiungere il traguardo.
ja: コーチはあなたの体重履歴、カロリー記録、目標を確認できます。予想体重、食事内容、目標達成の方法を聞いてみましょう。
ko: 코치는 체중 기록, 칼로리 로그, 목표를 볼 수 있어요. 예상 체중, 무엇을 먹을지, 목표 달성 방법을 물어보세요.
nl: Je coach ziet je gewichtsgeschiedenis, calorielog en doelen. Vraag naar verwacht gewicht, wat te eten of hoe je je doel bereikt.
pl: Twój trener widzi historię wagi, dziennik kalorii i cele. Zapytaj o przewidywaną wagę, co zjeść albo jak trafić w cel.
pt_br: Seu coach pode ver seu histórico de peso, registro de calorias e metas. Pergunte sobre o peso esperado, o que comer ou como atingir seu objetivo.
ro: Antrenorul tău îți vede istoricul greutății, jurnalul de calorii și obiectivele. Întreabă despre greutatea estimată, ce să mănânci sau cum să îți atingi ținta.
ru: Ваш тренер видит историю веса, журнал калорий и цели. Спросите об ожидаемом весе, что есть или как достичь цели.
uk: Ваш тренер бачить вашу історію ваги, записи калорій та цілі. Запитайте про очікувану вагу, що їсти або як досягти мети.
zh_hans: 你的教练可以查看你的体重记录、卡路里日志和目标。问问预期体重、吃什么或如何达成目标。

source: Your currently selected provider: %@. You can change this anytime in Settings → AI Provider. Each provider has its own privacy policy and may log requests.
ar: المزوّد المحدد حاليًا: %@. يمكنك تغيير هذا في أي وقت من الإعدادات ← مزوّد الذكاء الاصطناعي. لكل مزوّد سياسة خصوصية خاصة به وقد يسجّل الطلبات.
az: Hazırda seçilmiş provayder: %@. Bunu istənilən vaxt Ayarlar → AI Provayderi bölməsindən dəyişə bilərsiniz. Hər provayderin öz məxfilik siyasəti var və sorğuları qeyd edə bilər.
cs: Aktuálně vybraný poskytovatel: %@. Kdykoli ho můžeš změnit v Nastavení → AI poskytovatel. Každý poskytovatel má vlastní zásady ochrany soukromí a může logovat požadavky.
de: Aktuell ausgewählter Anbieter: %@. Du kannst dies jederzeit unter Einstellungen → KI-Anbieter ändern. Jeder Anbieter hat seine eigene Datenschutzrichtlinie und kann Anfragen protokollieren.
es: Proveedor seleccionado actualmente: %@. Puedes cambiarlo en cualquier momento en Ajustes → Proveedor de IA. Cada proveedor tiene su propia política de privacidad y puede registrar las solicitudes.
fr: Fournisseur actuellement sélectionné : %@. Vous pouvez le modifier à tout moment dans Réglages → Fournisseur d'IA. Chaque fournisseur a sa propre politique de confidentialité et peut journaliser les requêtes.
hi: आपका वर्तमान में चयनित प्रदाता: %@। आप इसे कभी भी सेटिंग्स → AI प्रदाता में बदल सकते हैं। प्रत्येक प्रदाता की अपनी गोपनीयता नीति है और वह अनुरोधों को लॉग कर सकता है।
it: Fornitore attualmente selezionato: %@. Puoi modificarlo in qualsiasi momento in Impostazioni → Fornitore IA. Ogni fornitore ha la propria informativa sulla privacy e può registrare le richieste.
ja: 現在選択されているプロバイダー: %@。設定 → AIプロバイダー からいつでも変更できます。各プロバイダーには独自のプライバシーポリシーがあり、リクエストを記録する場合があります。
ko: 현재 선택된 제공업체: %@. 설정 → AI 제공업체에서 언제든지 변경할 수 있습니다. 각 제공업체에는 자체 개인정보 처리방침이 있으며 요청을 기록할 수 있습니다.
nl: Huidige geselecteerde provider: %@. Je kunt dit op elk moment wijzigen in Instellingen → AI-provider. Elke provider heeft zijn eigen privacybeleid en kan verzoeken loggen.
pl: Aktualnie wybrany dostawca: %@. Możesz to zmienić w dowolnym momencie w Ustawienia → Dostawca AI. Każdy dostawca ma własną politykę prywatności i może logować żądania.
pt_br: Provedor selecionado atualmente: %@. Você pode alterar isso a qualquer momento em Configurações → Provedor de IA. Cada provedor tem sua própria política de privacidade e pode registrar solicitações.
ro: Furnizorul selectat în prezent: %@. Îl poți schimba oricând din Setări → Furnizor AI. Fiecare furnizor are propria politică de confidențialitate și poate înregistra solicitările.
ru: Текущий выбранный провайдер: %@. Вы можете изменить его в любое время в Настройки → Провайдер ИИ. У каждого провайдера своя политика конфиденциальности, и он может вести журнал запросов.
uk: Текущий вибранний провайдер: %@. Ви можете изменить его в любое время в Налаштування → Провайдер ШІ. У каждого провайдера своя политика конфиденциальности, и он может вести журнал запросов.
zh_hans: 你当前选择的提供商:%@。你可以随时在 设置 → AI 提供商 中更改。每个提供商都有自己的隐私政策,并可能记录请求。
